# Для удобства добавил функцию печати
def printArray(array):
    for j in range(len(array)):  # range(stop)/range(start, stop)/range(start, stop, step)
        for i in range(len(array[j])):
            print("{:4d}".format(array[j][i]), end='')  # ("{:2d}".format()) - Выравнивание по правому краю, ширина 4, пустое место заполняется пробельнами символами
        print()  # переход на новую строку

# Заполнение матрицы через numpy
"""
                              1  2  3  4
                              5  6  7  8
                              9 10 11 12
                             13 14 15 16
"""

import numpy as np  # Добавляем поддержку массивов и матриц

a = 6  # кол-во строк
b = 6  # кол-во столбцов
c = a * b + 1
matrix = np.arange(1, c).reshape(a, b)  # Генерируем матрицу со здначениями по возрастанию от 1 до c и размером a*b
print('numpy matrix: ', end='\n')
printArray(matrix)  # нормальная матрица (без изменений)


# 1) Заполнение матрицы через цикл по возрастанию _________________________________
"""
                             1  2  3  4
                             5  6  7  8
                             9 10 11 12
                            13 14 15 16
"""
n = 4  # строки
# m = 4  # столбцы
array = [0] * n
for i in range(n):
    array[i] = [0] * n
# создали массив: [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0]]

for i in range(0, n):
    for j in range(0, n):
        array[i][j] = i * n + j + 1
print('1. Заполнение по возрастанию: ', end='\n')
printArray(array)
# __________________________________________________________________

# 2) Заполнение матрицы через цикл змейкой_________________________________
"""
                         1  2  3  4
                         8  7  6  5
                         9 10 11 12
                        16 15 14 13
"""
n = 4  # строки
# m = 4  # столбцы
array = [0] * n
for i in range(n):
    array[i] = [0] * n
for i in range(0, n):  # строка
    for j in range(0, n):
        if i % 2 == 0:
            array[i][j] = i*n+j+1
        else:
            array [i][j] = i*n+n-j
print('2. Заполнение змейкой: ', end='\n')
printArray(array)
# __________________________________________________________________

# 3) Заполнение матрицы через цикл перевернутой змейкой_________________________________
"""
                        1  8  9 16
                        2  7 10 15
                        3  6 11 14
                        4  5 12 13
"""
n = 4  # строки
# m = 4  # столбцы
array = [0] * n
for i in range(n):
    array[i] = [0] * n
for i in range(0, n):
    for j in range(0, n):
        if i % 2 == 0:
            array[j][i] = i*n+j+1
        else:
            array [j][i] = i*n+n-j
print('3. Заполнение перевернутой змейкой: ', end='\n')
printArray(array)
# __________________________________________________________________

# 4) Заполнение матрицы через цикл спиралью_________________________________
"""
                        1  8  9 16
                        2  7 10 15
                        3  6 11 14
                        4  5 12 13
"""
n = 4  # строки
# m = 4  # столбцы
array = [0] * n
for i in range(n):
    array[i] = [0] * n
for i in range(0, n):
    for j in range(0, n):
        if i % 2 == 0:
            array[j][i] = i*n+j+1
        else:
            array [j][i] = i*n+n-j
print('4. Заполнение спиралью: ', end='\n')
printArray(array)
# __________________________________________________________________